/*
*********************************************************************************************************
*
*	模块名称 : BSP模块(For STM32F1XX)
*	文件名称 : bsp.c
*	版    本 : V1.0
*	说    明 : 这是硬件底层驱动程序模块的主文件。主要提供 bsp_Init()函数供主程序调用。主程序的每个c文件
*                  可以在开头添加 #include "bsp.h" 来包含所有的外设驱动模块。
*---------------------------------------------------------------------------------------------------------
*	修改记录 :
*		版本号  日期        作者     说明
*		V1.0
*
*
*	Copyright (C):
*
*********************************************************************************************************
*/

#include "includes.h"


/*
*********************************************************************************************************
*	函 数 名: bsp_Init
*	功能说明: 初始化硬件设备。只需要调用一次。该函数配置CPU寄存器和外设的寄存器并初始化一些全局变量。
*			 全局变量。
*	形    参: 无
*	返 回 值: 无
*********************************************************************************************************
*/
void bsp_Init(void)
{
    /*
    	由于ST固件库的启动文件已经执行了CPU系统时钟的初始化，所以不必再次重复配置系统时钟。
    	启动文件配置了CPU主时钟频率、内部Flash访问速度和可选的外部SRAM FSMC初始化。

    	系统时钟缺省配置为72MHz，如果需要更改，可以修改 system_stm32f10x.c 文件
    */

    /* 优先级分组设置为4 */
    NVIC_PriorityGroupConfig(NVIC_PriorityGroup_4);

    // bsp_InitUart(); 	/* 初始化串口 */
    // bsp_InitLed(); 		/* 初始LED指示灯端口 */
    bsp_sx127xIF_init();
#ifdef USER_WDG
    //bsp_InitWwdg(setTreg, setWreg, WWDG_Prescaler_8);
    bsp_InitIwdg();
#endif

}

/*
*********************************************************************************************************
*	函 数 名: BSP_CPU_ClkFreq
*	功能说明: 获取系统时钟，uCOS-II需要使用
*	形    参: 无
*	返 回 值: 系统时钟
*********************************************************************************************************
*/

CPU_INT32U  BSP_CPU_ClkFreq (void)
{
    RCC_ClocksTypeDef  rcc_clocks;

    RCC_GetClocksFreq(&rcc_clocks);
    return ((CPU_INT32U)rcc_clocks.HCLK_Frequency);
}


/*
*********************************************************************************************************
*	函 数 名: BSP_Tick_Init
*	功能说明: 初始化系统滴答时钟做为uCOS-II的系统时钟节拍，1ms一次
*	形    参: 无
*	返 回 值: 无
*********************************************************************************************************
*/
void BSP_Tick_Init (void)
{
    CPU_INT32U  cpu_clk_freq;
    CPU_INT32U  cnts;

    cpu_clk_freq = BSP_CPU_ClkFreq();                           /* 获取系统时钟  */

#if (OS_VERSION >= 30000u)
    cnts  = cpu_clk_freq / (CPU_INT32U)OSCfg_TickRate_Hz;
#else
    cnts  = cpu_clk_freq / (CPU_INT32U)OS_TICKS_PER_SEC;        /* 获得滴答定时器的参数  */
#endif

    OS_CPU_SysTickInit(cnts);                                   /* 这里默认的是最低优先级            */
    //SysTick_Config(SystemCoreClock / 1000);
}

/*
*********************************************************************************************************
*	函 数 名: bsp_Idle
*	功能说明: CPU空闲执行的操作
*	形    参: 无
*	返 回 值: 无
*********************************************************************************************************
*/
void bsp_Idle(void)
{
    ;
}

/***************************** (END OF FILE) *********************************/
